Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Select Method
Overload List
Name | Description
Select()
 Selects the shape from the database based on the name given in this instance.
Select(String)
 Selects the shape based on the given name from the database.
Top
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace